# [Gruppierungen] Daten gruppieren mit GroupBy

In [1]:
import pandas as pd
umsatz = pd.read_csv("datengrundlage.xls")

### Aggregation

In [3]:
umsatz.Umsatz.agg("mean")

6473.974347826087

In [4]:
umsatz.agg({"Umsatz":"mean"})

Umsatz    6473.974348
dtype: float64

### GroupBy

In [16]:
umsatz.groupby(by="Land")[["Umsatz"]].mean()

                             Umsatz
Land
China                   5424.118085
Deutschland             7638.501449
Mexiko                  6191.175000
Südkorea                6094.123753
USA                     6947.958604
Vereinigtes Königreich  6540.703279

In [10]:
# pd.DataFrame.groupby?

### GroupBy mit agg

In [15]:
umsatz.groupby(by="Land")[["Umsatz"]].agg("mean")

                             Umsatz
Land
China                   5424.118085
Deutschland             7638.501449
Mexiko                  6191.175000
Südkorea                6094.123753
USA                     6947.958604
Vereinigtes Königreich  6540.703279

### GroupBy mit aggregate

In [14]:
umsatz.groupby(by="Land")[["Umsatz"]].aggregate("mean")

                             Umsatz
Land
China                   5424.118085
Deutschland             7638.501449
Mexiko                  6191.175000
Südkorea                6094.123753
USA                     6947.958604
Vereinigtes Königreich  6540.703279

### Transpose

In [17]:
umsatz.groupby(by="Land")[["Umsatz"]].aggregate("mean").transpose()

Land,China,Deutschland,Mexiko,Südkorea,USA,Vereinigtes Königreich
Umsatz,5424.118085,7638.501449,6191.175,6094.123753,6947.958604,6540.703279

### Aggregationsmöglichkeiten

In [19]:
print("Summe:", umsatz.groupby("Land")[["Umsatz"]].aggregate("sum"))
print("Median:", umsatz.groupby("Land")[["Umsatz"]].aggregate("median"))
print("Quantile:", umsatz.groupby("Land")[["Umsatz"]].aggregate("quantile"))
print("STD", umsatz.groupby("Land")[["Umsatz"]].aggregate("std"))
print("VAR", umsatz.groupby("Land")[["Umsatz"]].aggregate("var"))

Summe:                             Umsatz
Land
China                   1019734.20
Deutschland             1581169.80
Mexiko                   829617.45
Südkorea                2565626.10
USA                     2139971.25
Vereinigtes Königreich   797965.80
Median:                           Umsatz
Land
China                   5496.525
Deutschland             7668.300
Mexiko                  6255.525
Südkorea                5911.050
USA                     6941.925
Vereinigtes Königreich  6472.800
Quantile:                           Umsatz
Land
China                   5496.525
Deutschland             7668.300
Mexiko                  6255.525
Südkorea                5911.050
USA                     6941.925
Vereinigtes Königreich  6472.800
STD                              Umsatz
Land
China                   1049.979777
Deutschland             1642.905614
Mexiko                  1686.103560
Südkorea                1796.572775
USA                     1598.499708
Vereinigtes Königreich  1810.705580
VAR                               Umsatz
Land
China                   1.102458e+06
Deutschland             2.699139e+06
Mexiko                  2.842945e+06
Südkorea                3.227674e+06
USA                     2.555201e+06
Vereinigtes Königreich  3.278655e+06